CFD-DEM/test2/sphere_6_cells/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleHFDIBFoam;
// application     HFDIBDEMFoam;
//~ application     simpleHFDIBDyMFoam;

//~ startFrom       startTime;
startFrom       latestTime;

startTime       0;

stopAt          endTime;
//stopAt          writeNow;

//~ endTime         0.01;
endTime         0.5;

//~ deltaT          0.0001;
deltaT          1e-6;
//~ deltaT          1e-8;

writeControl    adjustableRunTime;
//~ writeControl    timeStep;
//~ 
writeInterval  0.001;
//~ writeInterval   0.005;
//~ writeInterval   0.001;
//~ writeInterval   0.0001;
//~ writeInterval   1e-7;
//~ writeInterval   1;
//~ writeInterval   5;
//~ writeInterval   0.002;


purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

maxCo           1.0;

maxDeltaT       0.0003;

adjustTimeStep  no;

runTimeModifiable yes;

// ************************************************************************* //
