CFD-DEM/test2/sphere_6_cells/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bodyNames ("sphere");
interpolationSchemes
{
  U cell;
}

surfaceThreshold    1e-4;
stepDEM     1;
geometricD (1 1 1);
recordSimulation true;
recordFirstTimeStep true;

outputSetup
{
    basic true;
    iB  true;
    DEM false;
    addModel true;
    parallelDEM true;
}
DEM
{
    materials
    {
        particle
        {
            Y       1e8;
            nu      0.5;
            mu      0.1;
            adhN    0;
			eps		1;
        }

        wall
        {
            Y       1e8;
            nu      0.5;
            mu      0;
            adhN    0;
			eps		1;
        }    
    }
	LcCoeff 0.55;

    collisionPatches
    {
        movingWall
        {
            material wall;
            nVec (0 -1.0 0);
            planePoint (0.0 -0.05 0.0);
        }	
        outlet
        {
            material wall;
            nVec (0 1.0 0);
            planePoint (0.0 0.45 0.0);
        }
       fixedWall1
       {
           material wall;
           nVec (1.0 0 0);
           planePoint (0.02 0.0 0.0);
       }
       fixedWall2
       {
           material wall;
           nVec (-1.0 0 0);
           planePoint (-0.02 0.0 0.0);
       }
       fixedWall3
       {
           material wall;
           nVec (0 0 -1.0);
           planePoint (0.0 0.0 -0.02);
       }
       fixedWall4
       {
           material wall;
           nVec (0 0 1.0);
           planePoint (0.0 0.0 0.02);
       }  
	}
}

sphere
{

	fullyCoupledBody
	{
		velocity (0 0 0);
	}

	rho         rho [1 -3 0 0 0 0 0] 5000;

	refineMC 5;

	U
	{
	BC  noSlip;
	}

	bodyAddition
	{
		addModel   once;
		onceCoeffs{}
	}
		
	material particle;
	 bodyGeom sphere;
	 sphere
	 {
	     startPosition   (0.0 0.43 0.0);
	     radius  0.01;
	 }
	updateTorque false;
	sdBasedLambda false;
	interfaceSpan 1.0;
	startSynced false;
	refineBuffers 1;
	timesToSetStatic -1;
}

// ************************************************************************* //
